#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
int main()
{
	int a = 16;
	int c = -1;
	int e = 5;
	//>>是右移操作符
	//移动的是二进制位
	//16-->0000000000000000000000000000000000010000 正数原，反，补全部一样
	//-1-->1000000000000000000000000000000000000001--源码
	//     1111111111111111111111111111111111111110--反码 符号位不变，其他位按位取反，末尾减一
	//     1111111111111111111111111111111111111111--补码 反码加一 
	int b = a >> 1;	
	int s = c >> 1;
	int v = e << 1;
	printf("s=%d\n", s);
	printf("b=%d\n", b);
	printf("v=%d\n", v);
	return 0;
}
//右移操作符
//1.算术右移
//  右边丢弃，左边原符号位
//2.逻辑右移
//  右边丢弃，左边补0
//左移操作符
// 1.左边丢弃，右边补0 相当于*2